/**
 * Created by zhouma on 2017/5/24.
 */
//http://qt.gtimg.cn/q=sz000858
var tx_structor =[
    //{'id':0,'name':'未知'},
    {'id':1,'name':'名字'},
    {'id':2,'name':'代码'},
    {'id':3,'name':'当前价格'},
    {'id':4,'name':'昨收'},
    //{'id':5,'name':'今开'},
    {'id':6,'name':'成交量(手)'},
    // {'id':7,'name':'外盘'},
    // {'id':8,'name':'内盘'},
    // {'id':9,'name':'买一'},
    // {'id':10,'name':'买一量(手)'},
    // {'id':11,'name':'买二'},
    // {'id':12,'name':'买二量(手)'},
    // {'id':13,'name':'买三'},
    // {'id':14,'name':'买三量(手)'},
    // {'id':15,'name':'买四'},
    // {'id':16,'name':'买四量(手)'},
    // {'id':17,'name':'买五'},
    // {'id':18,'name':'买五量(手)'},
    // {'id':19,'name':'卖一'},
    // {'id':20,'name':'卖一量(手)'},
    // {'id':21,'name':'卖二'},
    // {'id':22,'name':'卖二量(手)'},
    // {'id':23,'name':'卖三'},
    // {'id':24,'name':'卖三量(手)'},
    // {'id':25,'name':'卖四'},
    // {'id':26,'name':'卖四量(手)'},
    // {'id':27,'name':'卖五'},
    // {'id':28,'name':'卖五(手)'},
    // {'id':29,'name':'最近逐笔成交'},
    {'id':30,'name':'时间'},
    {'id':31,'name':'涨跌'},
    {'id':32,'name':'涨跌%'},
    // {'id':33,'name':'最高'},
    // {'id':34,'name':'最低'},
    // {'id':35,'name':'价格/成交量(手)/成交额'},
    {'id':36,'name':'成交量(手)'},
    {'id':37,'name':'成交额(万)'},
    {'id':38,'name':'换手率'},
    // {'id':39,'name':'市盈率'},
    // {'id':40,'name':''},
    // {'id':41,'name':'最高'},
    // {'id':42,'name':'最低'},
    // {'id':43,'name':'振幅'},
    {'id':44,'name':'流通市值'},
    // {'id':45,'name':'总市值'},
    // {'id':46,'name':'市净率'},
    // {'id':47,'name':'涨停价'},
    // {'id':48,'name':'跌停价'},
    {'id':49,'name':'量比'}
];

var tx_title = function(){
    var temarr = [];
    for(var i = 0; i < tx_structor.length; i++){
        temarr.push(tx_structor[i].name)
    }
    return temarr;
};

exports.tx_structor = tx_structor;
exports.tx_title = tx_title;


// 获取盘口分析：
// http://qt.gtimg.cn/q=s_pksz000858
//     v_s_pksz000858="0.196~0.258~0.221~0.325";
// 0: 买盘大单
// 1: 买盘小单
// 2: 卖盘大单
// 3: 卖盘小单
//
// http://qt.gtimg.cn/q=s_sz000858
//     v_s_sz000858="51~五 粮 液~000858~27.78~0.18~0.65~417909~116339~~1054.52";
// 0: 未知
// 1: 名字
// 2: 代码
// 3: 当前价格
// 4: 涨跌
// 5: 涨跌%
// 6: 成交量（手）
// 7: 成交额（万）
// 8:
// 9: 总市值

//http://hq.sinajs.cn/list=sh601003,sz300104,sh601001,sh601002,sz000002

// 0：”大秦铁路”，股票名字；
// 1：”27.55″，今日开盘价；
// 2：”27.25″，昨日收盘价；
// 3：”26.91″，当前价格；
// 4：”27.55″，今日最高价；
// 5：”26.20″，今日最低价；
// 6：”26.91″，竞买价，即“买一”报价；
// 7：”26.92″，竞卖价，即“卖一”报价；
// 8：”22114263″，成交的股票数，由于股票交易以一百股为基本单位，所以在使用时，通常把该值除以一百；
// 9：”589824680″，成交金额，单位为“元”，为了一目了然，通常以“万元”为成交金额的单位，所以通常把该值除以一万；
// 10：”4695″，“买一”申请4695股，即47手；
// 11：”26.91″，“买一”报价；
// 12：”57590″，“买二”
// 13：”26.90″，“买二”
// 14：”14700″，“买三”
// 15：”26.89″，“买三”
// 16：”14300″，“买四”
// 17：”26.88″，“买四”
// 18：”15100″，“买五”
// 19：”26.87″，“买五”
// 20：”3100″，“卖一”申报3100股，即31手；
// 21：”26.92″，“卖一”报价
// (22, 23), (24, 25), (26,27), (28, 29)分别为“卖二”至“卖四的情况”
// 30：”2008-01-11″，日期；
// 31：”15:05:32″，时间；
//{'id':0,'name':'股票名字'}

// var sina_structor = [
//     {'id':0,'name':'股票名字'},
//     {'id':1,'name':'今日开盘价'},
//     {'id':2,'name':'昨日收盘价'},
//     {'id':3,'name':'当前价格'},
//     {'id':4,'name':'今日最高价'},
//     {'id':5,'name':'今日最低价'},
//     {'id':6,'name':'竞买价'},
//     {'id':7,'name':'竞卖价'},
//     {'id':8,'name':'成交的股票数'},
//     {'id':9,'name':'成交金额'},
//     {'id':10,'name':'买一申请4695股'},
//     {'id':11,'name':'买一报价'},
//     {'id':12,'name':'买二'},
//     {'id':13,'name':'买二'},
//     {'id':14,'name':'买三'},
//     {'id':15,'name':'买三'},
//     {'id':16,'name':'买四'},
//     {'id':17,'name':'买四'},
//     {'id':18,'name':'买五'},
//     {'id':19,'name':'买五'},
//     {'id':20,'name':'卖一申报3100股'},
//     {'id':21,'name':'卖一报价'},
//     {'id':22,'name':'卖二'},
//     {'id':23,'name':'卖二'},
//     {'id':24,'name':'卖三'},
//     {'id':25,'name':'卖三'},
//     {'id':26,'name':'卖四'},
//     {'id':27,'name':'卖四'},
//     {'id':28,'name':'卖五'},
//     {'id':29,'name':'卖五'},
//     {'id':30,'name':'日期'},
//     {'id':31,'name':'时间'}
// ];